import { IBest250FilmsResponse } from './services/film/film.interface';

export const films: IBest250FilmsResponse = {
  docs: [
    {
      id: 535341,
      name: '1+1',
      type: 'movie',
      year: 2011,
      description:
        'Пострадав в результате несчастного случая, богатый аристократ Филипп нанимает в помощники человека, который менее всего подходит для этой работы, – молодого жителя предместья Дрисса, только что освободившегося из тюрьмы. Несмотря на то, что Филипп прикован к инвалидному креслу, Дриссу удается привнести в размеренную жизнь аристократа дух приключений.',
      slogan:
        "Sometimes you have to reach into someone else's world to find out what's missing in your own.",
      rating: {
        kp: 8.824,
        imdb: 8.5,
        filmCritics: 6.8,
        russianFilmCritics: 100,
      },
      poster: {
        url: 'https://image.openmoviedb.com/kinopoisk-images/1946459/bf93b465-1189-4155-9dd1-cb9fb5cb1bb5/orig',
        previewUrl:
          'https://image.openmoviedb.com/kinopoisk-images/1946459/bf93b465-1189-4155-9dd1-cb9fb5cb1bb5/x1000',
      },
      genres: [
        {
          name: 'драма',
        },
        {
          name: 'комедия',
        },
      ],
    },
    {
      id: 1143242,
      name: 'Джентльмены',
      type: 'movie',
      year: 2019,
      description:
        'Один ушлый американец ещё со студенческих лет приторговывал наркотиками, а теперь придумал схему нелегального обогащения с использованием поместий обедневшей английской аристократии и очень неплохо на этом разбогател. Другой пронырливый журналист приходит к Рэю, правой руке американца, и предлагает тому купить киносценарий, в котором подробно описаны преступления его босса при участии других представителей лондонского криминального мира — партнёра-еврея, китайской диаспоры, чернокожих спортсменов и даже русского олигарха.',
      slogan: 'Criminal. Class',
      rating: {
        kp: 8.57,
        imdb: 7.8,
        filmCritics: 6.5,
        russianFilmCritics: 85.7143,
      },
      poster: {
        url: 'https://image.openmoviedb.com/kinopoisk-images/1599028/637271d5-61b4-4e46-ac83-6d07494c7645/orig',
        previewUrl:
          'https://image.openmoviedb.com/kinopoisk-images/1599028/637271d5-61b4-4e46-ac83-6d07494c7645/x1000',
      },
      genres: [
        {
          name: 'криминал',
        },
        {
          name: 'комедия',
        },
        {
          name: 'боевик',
        },
      ],
    },
    {
      id: 462682,
      name: 'Волк с Уолл-стрит',
      type: 'movie',
      year: 2013,
      description:
        '1987 год. Джордан Белфорт становится брокером в успешном инвестиционном банке. Вскоре банк закрывается после внезапного обвала индекса Доу-Джонса. По совету жены Терезы Джордан устраивается в небольшое заведение, занимающееся мелкими акциями. Его настойчивый стиль общения с клиентами и врождённая харизма быстро даёт свои плоды. Он знакомится с соседом по дому Донни, торговцем, который сразу находит общий язык с Джорданом и решает открыть с ним собственную фирму. В качестве сотрудников они нанимают нескольких друзей Белфорта, его отца Макса и называют компанию «Стрэттон Оукмонт». В свободное от работы время Джордан прожигает жизнь: лавирует от одной вечеринки к другой, вступает в сексуальные отношения с проститутками, употребляет множество наркотических препаратов, в том числе кокаин и кваалюд. Однажды наступает момент, когда быстрым обогащением Белфорта начинает интересоваться агент ФБР...',
      slogan: 'Earn. Spend. Party.',
      rating: {
        kp: 8.016,
        imdb: 8.2,
        filmCritics: 7.8,
        russianFilmCritics: 77.4194,
      },
      poster: {
        url: 'https://image.openmoviedb.com/kinopoisk-images/1946459/5c758ac0-7a5c-4f00-a94f-1be680a312fb/orig',
        previewUrl:
          'https://image.openmoviedb.com/kinopoisk-images/1946459/5c758ac0-7a5c-4f00-a94f-1be680a312fb/x1000',
      },
      genres: [
        {
          name: 'драма',
        },
        {
          name: 'криминал',
        },
        {
          name: 'биография',
        },
        {
          name: 'комедия',
        },
      ],
    },
    {
      id: 41519,
      name: 'Брат',
      type: 'movie',
      year: 1997,
      description:
        'Демобилизовавшись, Данила Багров вернулся в родной городок. Но скучная жизнь российской провинции не устраивала его, и он решился податься в Петербург, где, по слухам, уже несколько лет процветает его старший брат. Данила нашел брата. Но все оказалось не так просто — брат работает наемным убийцей.',
      slogan: 'null',
      rating: {
        kp: 8.315,
        imdb: 7.8,
        filmCritics: 7.6,
        russianFilmCritics: 0,
      },
      poster: {
        url: 'https://image.openmoviedb.com/kinopoisk-images/1704946/e9008e2f-433f-43b0-b9b8-2ea8e3fb6c9b/orig',
        previewUrl:
          'https://image.openmoviedb.com/kinopoisk-images/1704946/e9008e2f-433f-43b0-b9b8-2ea8e3fb6c9b/x1000',
      },
      genres: [
        {
          name: 'драма',
        },
        {
          name: 'криминал',
        },
        {
          name: 'боевик',
        },
      ],
    },
    {
      rating: {
        kp: 8.277,
        imdb: 7.7,
        filmCritics: 5.9,
        russianFilmCritics: 0,
      },
      id: 8124,
      type: 'movie',
      name: 'Один дома',
      description:
        'Американское семейство отправляется из Чикаго в Европу, но в спешке сборов бестолковые родители забывают дома... одного из своих детей. Юное создание, однако, не теряется и демонстрирует чудеса изобретательности. И когда в дом залезают грабители, им приходится не раз пожалеть о встрече с милым крошкой.',
      slogan:
        "When Kevin's Family Left For Vacation, They Forgot One Minor Detail: Kevin. But Don't Worry... He Cooks. He Cleans. He Kicks Some Butt",
      year: 1990,
      poster: {
        url: 'https://image.openmoviedb.com/kinopoisk-images/6201401/022a58e3-5b9b-411b-bfb3-09fedb700401/orig',
        previewUrl:
          'https://image.openmoviedb.com/kinopoisk-images/6201401/022a58e3-5b9b-411b-bfb3-09fedb700401/x1000',
      },
      genres: [
        {
          name: 'комедия',
        },
        {
          name: 'семейный',
        },
      ],
    },
    {
      rating: {
        kp: 7.975,
        imdb: 7.9,
        filmCritics: 7.5,
        russianFilmCritics: 75,
      },
      id: 251733,
      type: 'movie',
      name: 'Аватар',
      description:
        'Бывший морпех Джейк Салли прикован к инвалидному креслу. Несмотря на немощное тело, Джейк в душе по-прежнему остается воином. Он получает задание совершить путешествие в несколько световых лет к базе землян на планете Пандора, где корпорации добывают редкий минерал, имеющий огромное значение для выхода Земли из энергетического кризиса.',
      slogan: 'Это новый мир',
      year: 2009,
      poster: {
        url: 'https://image.openmoviedb.com/kinopoisk-images/1599028/4adf61aa-3cb7-4381-9245-523971e5b4c8/orig',
        previewUrl:
          'https://image.openmoviedb.com/kinopoisk-images/1599028/4adf61aa-3cb7-4381-9245-523971e5b4c8/x1000',
      },
      genres: [
        {
          name: 'фантастика',
        },
        {
          name: 'боевик',
        },
        {
          name: 'драма',
        },
        {
          name: 'приключения',
        },
      ],
    },
    {
      id: 1188529,
      name: 'Достать ножи',
      type: 'movie',
      year: 2019,
      description:
        'На следующее утро после празднования 85-летия известного автора криминальных романов Харлана Тромби виновника торжества находят мёртвым. Налицо — явное самоубийство, но полиция по протоколу опрашивает всех присутствующих в особняке членов семьи, хотя, в этом деле больше заинтересован частный детектив Бенуа Блан. Тем же утром он получил конверт с наличными от неизвестного и заказ на расследование смерти Харлана. Не нужно быть опытным следователем, чтобы понять, что все приукрашивают свои отношения с почившим главой семейства, но Блану достаётся настоящий подарок — медсестра покойного, которая физически не выносит ложь.',
      slogan: 'У каждого свой мотив',
      rating: {
        kp: 8.112,
        imdb: 7.9,
        filmCritics: 8.3,
        russianFilmCritics: 89.4737,
      },
      poster: {
        url: 'https://image.openmoviedb.com/kinopoisk-images/1777765/bb8afbd6-c9cd-4631-99e9-3fecf241dbaf/orig',
        previewUrl:
          'https://image.openmoviedb.com/kinopoisk-images/1777765/bb8afbd6-c9cd-4631-99e9-3fecf241dbaf/x1000',
      },
      genres: [
        {
          name: 'детектив',
        },
        {
          name: 'комедия',
        },
        {
          name: 'драма',
        },
        {
          name: 'криминал',
        },
      ],
    },
    {
      id: 42664,
      name: 'Иван Васильевич меняет профессию',
      type: 'movie',
      year: 1973,
      description:
        'Инженер-изобретатель Тимофеев сконструировал машину времени, которая соединила его квартиру с XVI веком — точнее, с палатами государя Ивана Грозного. Туда-то и попадают тёзка царя пенсионер-общественник Иван Васильевич Бунша и квартирный вор Жорж Милославский, а сам великий государь оказывается в квартире Тимофеева.',
      slogan: 'null',
      rating: {
        kp: 8.787,
        imdb: 8.2,
        filmCritics: 0,
        russianFilmCritics: 0,
      },
      poster: {
        url: 'https://image.openmoviedb.com/kinopoisk-images/6201401/a7ef44b8-1983-4992-a889-da6f87a3f559/orig',
        previewUrl:
          'https://image.openmoviedb.com/kinopoisk-images/6201401/a7ef44b8-1983-4992-a889-da6f87a3f559/x1000',
      },
      genres: [
        {
          name: 'комедия',
        },
        {
          name: 'фантастика',
        },
        {
          name: 'приключения',
        },
      ],
    },
    {
      id: 1108577,
      name: 'Зеленая книга',
      type: 'movie',
      year: 2018,
      description:
        '1960-е годы. После закрытия нью-йоркского ночного клуба на ремонт вышибала Тони по прозвищу Болтун ищет подработку на пару месяцев. Как раз в это время Дон Ширли — утонченный светский лев, богатый и талантливый чернокожий музыкант, исполняющий классическую музыку — собирается в турне по южным штатам, где ещё сильны расистские убеждения и царит сегрегация. Он нанимает Тони в качестве водителя, телохранителя и человека, способного решать текущие проблемы. У этих двоих так мало общего, и эта поездка навсегда изменит жизнь обоих.',
      slogan: 'Inspired by a True Friendship',
      rating: {
        kp: 8.463,
        imdb: 8.2,
        filmCritics: 7.2,
        russianFilmCritics: 93.3333,
      },
      poster: {
        url: 'https://image.openmoviedb.com/kinopoisk-images/1599028/4b27e219-a8a5-4d85-9874-57d6016e0837/orig',
        previewUrl:
          'https://image.openmoviedb.com/kinopoisk-images/1599028/4b27e219-a8a5-4d85-9874-57d6016e0837/x1000',
      },
      genres: [
        {
          name: 'биография',
        },
        {
          name: 'комедия',
        },
        {
          name: 'драма',
        },
      ],
    },
    {
      id: 41520,
      name: 'Брат 2',
      type: 'movie',
      year: 2000,
      description:
        'Участвуя в программе на телевидении, Данила Багров встречает своих друзей по службе в Чечне. Одного из них внезапно убивают. Выясняется, что у того были неприятности из-за брата-хоккеиста в Америке. Данила должен разобраться. Он вылетает в Америку и за компанию берёт с собой старшего брата.',
      slogan: 'Данила возвращается!',
      rating: {
        kp: 8.207,
        imdb: 7.6,
        filmCritics: 0,
        russianFilmCritics: 0,
      },
      poster: {
        url: 'https://image.openmoviedb.com/kinopoisk-images/1704946/80eab631-346c-4c29-b14d-1fa1438158f9/orig',
        previewUrl:
          'https://image.openmoviedb.com/kinopoisk-images/1704946/80eab631-346c-4c29-b14d-1fa1438158f9/x1000',
      },
      genres: [
        {
          name: 'боевик',
        },
        {
          name: 'криминал',
        },
      ],
    },
  ],
  total: 250,
  limit: 10,
  page: 1,
  pages: 25,
};
